# Yelp Restaurant Review Data Analysis

This notebook is for data cleaning and merging different datasets into one.

## Business.json Data

In [20]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

# Columns that are used for the initial dataframe
cols = ['business_id', 'city', 'state', 'stars', 'review_count', 'categories']

business_df = pd.read_csv('..\Yelp Dataset\yelp_business.csv', index_col='business_id', usecols=cols)

In [21]:
business_df.head()

,city,state,stars,review_count,categories
business_id,,,,,
FYWN1wneV18bWNgQjJ2GNg,Ahwatukee,AZ,4.0,22,Dentists;General Dentistry;Health & Medical;Or...
He-G7vWjzVUysIKrfNbPUQ,McMurray,PA,3.0,11,Hair Stylists;Hair Salons;Men's Hair Salons;Bl...
KQPW8lFf1y5BT2MxiSZ3QA,Phoenix,AZ,1.5,18,Departments of Motor Vehicles;Public Services ...
8DShNS-LuFqpEWIp0HxijA,Tempe,AZ,3.0,9,Sporting Goods;Shopping
PfOCPjBrlQAnz__NXj9h_w,Cuyahoga Falls,OH,3.5,116,American (New);Nightlife;Bars;Sandwiches;Ameri...

In [22]:
business_df.shape

(174567, 5)

In [23]:
business_df.describe(include='all')

             city   state          stars   review_count         categories
count      174566  174566  174567.000000  174567.000000             174567
unique       1093      67            NaN            NaN              76419
top     Las Vegas      AZ            NaN            NaN  Restaurants;Pizza
freq        26775   52214            NaN            NaN                990
mean          NaN     NaN       3.632196      30.137059                NaN
std           NaN     NaN       1.003739      98.208174                NaN
min           NaN     NaN       1.000000       3.000000                NaN
25%           NaN     NaN       3.000000       4.000000                NaN
50%           NaN     NaN       3.500000       8.000000                NaN
75%           NaN     NaN       4.500000      23.000000                NaN
max           NaN     NaN       5.000000    7361.000000                NaN

Because we are visualizing only restaurant review data, we want to extract observations that have Restaurants value in their category attribute.

In [24]:
business_df.categories.value_counts()

Restaurants;Pizza                                                                                                                                                                                       990
Pizza;Restaurants                                                                                                                                                                                       987
Food;Coffee & Tea                                                                                                                                                                                       978
Nail Salons;Beauty & Spas                                                                                                                                                                               936
Coffee & Tea;Food                                                                                                                                                                                       929
Beauty & Spas;Nail Salons                                                                                                                                                                               909
Mexican;Restaurants                                                                                                                                                                                     906
Restaurants;Mexican                                                                                                                                                                                     864
Restaurants;Chinese                                                                                                                                                                                     857
Chinese;Restaurants                                                                                                                                                                                     839
Beauty & Spas;Hair Salons                                                                                                                                                                               839
Hair Salons;Beauty & Spas                                                                                                                                                                               781
Restaurants;Italian                                                                                                                                                                                     615
Italian;Restaurants                                                                                                                                                                                     554
Auto Repair;Automotive                                                                                                                                                                                  551
Grocery;Food                                                                                                                                                                                            538
Food;Grocery                                                                                                                                                                                            522
Automotive;Auto Repair                                                                                                                                                                                  504
Na                                                                                                                                                                                                      500
Food;Ice Cream & Frozen Yogurt                                                                                                                                                                          424
Ice Cream & Frozen Yogurt;Food                                                                                                                                                                          389
Financial Services;Banks & Credit Unions                                                                                                                                                                382
Food;Bakeries                                                                                                                                                                                           374
Restaurants                                                                                                                                                                                             362
Bakeries;Food                                                                                                                                                                                           357
Beauty & Spas;Barbers                                                                                                                                                                                   355
Banks & Credit Unions;Financial Services                                                                                                                                                                346
Barbers;Beauty & Spas                                                                                                                                                                                   346
Restaurants;American (Traditional)                                                                                                                                                                      311
Apartments;Real Estate;Home Services                                                                                                                                                                    309
                                                                                                                                                                                                       ...
Permanent Makeup;Beauty & Spas;Piercing;Arts & Entertainment;Tattoo                                                                                                                                       1
Local Services;Active Life;Funeral Services & Cemeteries                                                                                                                                                  1
Farming Equipment;Trailer Dealers;Shopping;Landscaping;Home & Garden;Automotive;Nurseries & Gardening;Home Services;Livestock Feed & Supply                                                               1
Nutritionists;Health & Medical;Discount Store;Juice Bars & Smoothies;Vitamins & Supplements;Food;Weight Loss Centers;Shopping                                                                             1
Shopping;Local Flavor;Pop-up Shops                                                                                                                                                                        1
Restaurants;Bars;Breakfast & Brunch;Mexican;Nightlife;Sports Bars                                                                                                                                         1
Sushi Bars;Restaurants;Korean;Japanese                                                                                                                                                                    1
Beaches;Dog Parks;Parks;Active Life                                                                                                                                                                       1
Department Stores;Fashion;Electronics;Grocery;Food;Mobile Phones;Drugstores;Shopping;Discount Store                                                                                                       1
Bars;Restaurants;Nightlife;Barbeque                                                                                                                                                                       1
Italian;Buffets;Restaurants;Food;Ice Cream & Frozen Yogurt;Sandwiches;Pizza;Fast Food                                                                                                                     1
Food Trucks;Street Vendors;Restaurants;Food Stands;Food                                                                                                                                                   1
Caterers;Event Planning & Services;Seafood;Food;Salad;Desserts;Italian;Venues & Event Spaces;Restaurants                                                                                                  1
Restaurants;Pizza;Buffets;Chicken Wings                                                                                                                                                                   1
Desserts;Restaurants;Food;Ice Cream & Frozen Yogurt;Italian                                                                                                                                               1
Trainers;Gyms;Boxing;Fitness & Instruction;Martial Arts;Active Life                                                                                                                                       1
Food;Vegan;Gluten-Free;Vegetarian;Breakfast & Brunch;Desserts;Mediterranean;Sandwiches;Restaurants                                                                                                        1
Shopping;Fashion;Outlet Stores;Men's Clothing;Women's Clothing                                                                                                                                            1
Real Estate;Local Services;Estate Planning Law;Professional Services;Funeral Services & Cemeteries;Lawyers;Home Services;Shopping;Estate Liquidation;Antiques;Wills;Trusts;& Probates;Auction Houses      1
Shopping;Drugstores;Cosmetics & Beauty Supply;Beauty & Spas;Convenience Stores;Photography Stores & Services;Food                                                                                         1
Food;Bubble Tea;Coffee & Tea;Restaurants;Taiwanese;Juice Bars & Smoothies                                                                                                                                 1
Fitness & Instruction;Massage Therapy;Massage Schools;Acupuncture;Active Life;Traditional Chinese Medicine;Yoga;Health & Medical;Specialty Schools;Education                                              1
Massage Therapy;Beauty & Spas;Health & Medical;Skin Care;Massage                                                                                                                                          1
Home Services;Home & Garden;Shopping;Furniture Stores;Home Decor;Kitchen & Bath;Lighting Fixtures & Equipment                                                                                             1
Flowers & Gifts;Food;Shopping;Tobacco Shops;Beer;Wine & Spirits;Head Shops                                                                                                                                1
Food;Breakfast & Brunch;Restaurants;French;Southern;Coffee & Tea                                                                                                                                          1
Pressure Washers;Window Washing;Home Services                                                                                                                                                             1
Clowns;Balloon Services;Fashion;Party & Event Planning;Arts & Entertainment;Performing Arts;Shopping;Face Painting;Event Planning & Services                                                              1
Graphic Design;Web Design;Professional Services                                                                                                                                                           1
Arts & Entertainment;Food;Grocery;Wineries                                                                                                                                                                1
Name: categories, Length: 76419, dtype: int64

In [25]:
# Matching 'Restaurants' string with categories attribute and extracting a new dataframe
restaurants_df = business_df[business_df['categories'].str.contains('Restaurants')]

In [26]:
restaurants_df.shape

(54618, 5)

In [27]:
restaurants_df.head()

,city,state,stars,review_count,categories
business_id,,,,,
PfOCPjBrlQAnz__NXj9h_w,Cuyahoga Falls,OH,3.5,116,American (New);Nightlife;Bars;Sandwiches;Ameri...
o9eMRCWt5PkpLDE0gOPtcQ,Stuttgart,BW,4.0,5,Italian;Restaurants
XOSRcvtaKc_Q5H1SAzN20A,Houston,PA,4.5,3,Breakfast & Brunch;Gluten-Free;Coffee & Tea;Fo...
fNMVV_ZX7CJSDWQGdOM8Nw,Charlotte,NC,3.5,7,Restaurants;American (Traditional)
l09JfMeQ6ynYs5MCJtrcmQ,Toronto,ON,3.0,12,Italian;French;Restaurants

Inspecting the DF for missing values

In [28]:
restaurants_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 54618 entries, PfOCPjBrlQAnz__NXj9h_w to UdEmYOnk2iJDY9lpEPAlJQ
Data columns (total 5 columns):
city            54618 non-null object
state           54618 non-null object
stars           54618 non-null float64
review_count    54618 non-null int64
categories      54618 non-null object
dtypes: float64(1), int64(1), object(3)
memory usage: 2.5+ MB

We want to replace the Restaurants string in categories attribute, because it doesn't provide any additional information

In [29]:
restaurants_df['categories'] = restaurants_df['categories'].replace({';Restaurants' : '', 'Restaurants;' : '', 'Restaurants' : ''}, regex=True)

C:\Users\joona\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [30]:
restaurants_df.head()

,city,state,stars,review_count,categories
business_id,,,,,
PfOCPjBrlQAnz__NXj9h_w,Cuyahoga Falls,OH,3.5,116,American (New);Nightlife;Bars;Sandwiches;Ameri...
o9eMRCWt5PkpLDE0gOPtcQ,Stuttgart,BW,4.0,5,Italian
XOSRcvtaKc_Q5H1SAzN20A,Houston,PA,4.5,3,Breakfast & Brunch;Gluten-Free;Coffee & Tea;Fo...
fNMVV_ZX7CJSDWQGdOM8Nw,Charlotte,NC,3.5,7,American (Traditional)
l09JfMeQ6ynYs5MCJtrcmQ,Toronto,ON,3.0,12,Italian;French

Now we want to split the categories column by ";" character and add the first given category (the most important one) to the restaurants_df.

In [31]:
restaurants_df['category'] = restaurants_df.categories.str.split(';').str[0]

# Drop the categories column from the dataframe
r_df_categorized = restaurants_df.drop(columns='categories')
r_df_categorized.head()

C:\Users\joona\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

,city,state,stars,review_count,category
business_id,,,,,
PfOCPjBrlQAnz__NXj9h_w,Cuyahoga Falls,OH,3.5,116,American (New)
o9eMRCWt5PkpLDE0gOPtcQ,Stuttgart,BW,4.0,5,Italian
XOSRcvtaKc_Q5H1SAzN20A,Houston,PA,4.5,3,Breakfast & Brunch
fNMVV_ZX7CJSDWQGdOM8Nw,Charlotte,NC,3.5,7,American (Traditional)
l09JfMeQ6ynYs5MCJtrcmQ,Toronto,ON,3.0,12,Italian

In [32]:
# Count frequencies of different cuisines
r_df_categorized['category'].value_counts()

Pizza                        3388
Fast Food                    2851
Mexican                      2559
Chinese                      2539
Food                         2530
Italian                      2326
Sandwiches                   2304
American (Traditional)       2047
Burgers                      1826
Nightlife                    1570
Breakfast & Brunch           1498
Bars                         1488
American (New)               1391
Japanese                     1159
Cafes                        1024
Sushi Bars                    908
Thai                          833
Seafood                       801
Indian                        800
Chicken Wings                 787
Barbeque                      672
Vietnamese                    647
Mediterranean                 623
Asian Fusion                  601
Delis                         585
Coffee & Tea                  582
Steakhouses                   565
Canadian (New)                553
Greek                         521
Salad                         506
                             ...
Shared Office Spaces            1
Roofing                         1
Fischbroetchen                  1
Soccer                          1
Massage Therapy                 1
Sailing                         1
Laundry Services                1
Ethical Grocery                 1
Climbing                        1
Izakaya                         1
Lakes                           1
Nail Salons                     1
Food Tours                      1
CSA                             1
Honduran                        1
Kitchen & Bath                  1
Iberian                         1
Cosmetics & Beauty Supply       1
Beer Hall                       1
Plumbing                        1
Wok                             1
Grilling Equipment              1
Horse Racing                    1
Recreation Centers              1
Amateur Sports Teams            1
Hiking                          1
Limos                           1
Flatbread                       1
Discount Store                  1
Furniture Rental                1
Name: category, Length: 409, dtype: int64

In [33]:
# Let's pick 50 most frequent out of these and read them into a list

# Read all food categories to an list
food_categories_list = r_df_categorized['category'].value_counts().index.tolist()

# Select 50 most frequent cuisines and remove one empty (category with only Restaurant) and 'Event Planning and Services'
food_categories_50 = food_categories_list[0:50]
print(food_categories_50)

['Pizza', 'Fast Food', 'Mexican', 'Chinese', 'Food', 'Italian', 'Sandwiches', 'American (Traditional)', 'Burgers', 'Nightlife', 'Breakfast & Brunch', 'Bars', 'American (New)', 'Japanese', 'Cafes', 'Sushi Bars', 'Thai', 'Seafood', 'Indian', 'Chicken Wings', 'Barbeque', 'Vietnamese', 'Mediterranean', 'Asian Fusion', 'Delis', 'Coffee & Tea', 'Steakhouses', 'Canadian (New)', 'Greek', 'Salad', 'French', 'Diners', 'Middle Eastern', 'Korean', 'Event Planning & Services', '', 'Buffets', 'Caribbean', 'Caterers', 'Bakeries', 'Sports Bars', 'Hot Dogs', 'Desserts', 'Vegetarian', 'Specialty Food', 'Pubs', 'Tex-Mex', 'German', 'Latin American', 'Soup']

In [34]:
# Let's remove categories that are not usefull in our case (for rxample nightlife)

indexes = (4, 9, 11, 25, 34, 35, 36, 38, 40, 44, 45)
food_categories = np.delete(food_categories_50, indexes)
print(food_categories)

['Pizza' 'Fast Food' 'Mexican' 'Chinese' 'Italian' 'Sandwiches'
 'American (Traditional)' 'Burgers' 'Breakfast & Brunch' 'American (New)'
 'Japanese' 'Cafes' 'Sushi Bars' 'Thai' 'Seafood' 'Indian' 'Chicken Wings'
 'Barbeque' 'Vietnamese' 'Mediterranean' 'Asian Fusion' 'Delis'
 'Steakhouses' 'Canadian (New)' 'Greek' 'Salad' 'French' 'Diners'
 'Middle Eastern' 'Korean' 'Caribbean' 'Bakeries' 'Hot Dogs' 'Desserts'
 'Vegetarian' 'Tex-Mex' 'German' 'Latin American' 'Soup']

In [35]:
# Filter rows of containing only these most frequently used cuisines

r_df_clean = r_df_categorized[r_df_categorized['category'].isin(food_categories)]
r_df_clean.info()

<class 'pandas.core.frame.DataFrame'>
Index: 38454 entries, PfOCPjBrlQAnz__NXj9h_w to UdEmYOnk2iJDY9lpEPAlJQ
Data columns (total 5 columns):
city            38454 non-null object
state           38454 non-null object
stars           38454 non-null float64
review_count    38454 non-null int64
category        38454 non-null object
dtypes: float64(1), int64(1), object(3)
memory usage: 1.8+ MB

In [36]:
r_df_clean.describe(include='all')

           city  state         stars  review_count category
count     38454  38454  38454.000000  38454.000000    38454
unique      691     37           NaN           NaN       39
top     Toronto     ON           NaN           NaN    Pizza
freq       4890   9545           NaN           NaN     3388
mean        NaN    NaN      3.391130     55.770427      NaN
std         NaN    NaN      0.806129    142.506078      NaN
min         NaN    NaN      1.000000      3.000000      NaN
25%         NaN    NaN      3.000000      7.000000      NaN
50%         NaN    NaN      3.500000     17.000000      NaN
75%         NaN    NaN      4.000000     51.000000      NaN
max         NaN    NaN      5.000000   7361.000000      NaN

# Review.json Data

In [37]:
# Columns that are used for the initial dataframe
cols = ['review_id', 'user_id', 'business_id', 'stars', 'date']

review_df = pd.read_csv('..\Yelp Dataset\yelp_review.csv', index_col='review_id', usecols=cols)

In [38]:
review_df.head()

,user_id,business_id,stars,date
review_id,,,,
vkVSCC7xljjrAI4UGfnKEQ,bv2nCi5Qv5vroFiqKGopiw,AEx2SYEUJmTxVVB18LlCwA,5,2016-05-28
n6QzIUObkYshz4dz2QRJTw,bv2nCi5Qv5vroFiqKGopiw,VR6GpWIda3SfvPC-lg9H3w,5,2016-05-28
MV3CcKScW05u5LVfF6ok0g,bv2nCi5Qv5vroFiqKGopiw,CKC0-MOWMqoeWf6s-szl8g,5,2016-05-28
IXvOzsEMYtiJI0CARmj77Q,bv2nCi5Qv5vroFiqKGopiw,ACFtxLv8pGrrxMm6EgjreA,4,2016-05-28
L_9BTb55X0GDtThi6GlZ6w,bv2nCi5Qv5vroFiqKGopiw,s2I_Ni76bjJNK9yG60iD-Q,4,2016-05-28

In [39]:
# Whole dataset has: 5261668 entries
review_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5261668 entries, vkVSCC7xljjrAI4UGfnKEQ to ldsIs3sGXPJ7WM7VyAm4lQ
Data columns (total 4 columns):
user_id        object
business_id    object
stars          int64
date           object
dtypes: int64(1), object(3)
memory usage: 200.7+ MB

In [40]:
review_df.describe()

              stars
count  5.261668e+06
mean   3.727739e+00
std    1.433593e+00
min    1.000000e+00
25%    3.000000e+00
50%    4.000000e+00
75%    5.000000e+00
max    5.000000e+00

In [41]:
review_df[review_df.duplicated()]

Empty DataFrame
Columns: [user_id, business_id, stars, date]
Index: []

In [42]:
review_df.isna().sum()

user_id        0
business_id    0
stars          0
date           0
dtype: int64

Dataset has no missing or duplicate values

## User.json Data

In [45]:
# Columns that are used for the initial dataframe
cols = ['user_id', 'review_count', 'average_stars']

user_df = pd.read_csv('..\Yelp Dataset\yelp_user.csv', index_col='user_id', usecols=cols)

In [46]:
user_df.head()

                        review_count  average_stars
user_id
JJ-aSuM4pCFPdkfoZ34q0Q            10           3.70
uUzsFQn_6cXDh6rPNGbIFA             1           2.00
mBneaEEH5EMyxaVyqS-72A             6           4.67
W5mJGs-dcDWRGEhAzUYtoA             3           4.67
4E8--zUZO1Rr1IBK4_83fg            11           3.45

In [47]:
user_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1326100 entries, JJ-aSuM4pCFPdkfoZ34q0Q to q-1Tz4SvaTpGEMhI_xwm0Q
Data columns (total 2 columns):
review_count     1326100 non-null int64
average_stars    1326100 non-null float64
dtypes: float64(1), int64(1)
memory usage: 30.4+ MB

In [48]:
user_df.describe()

       review_count  average_stars
count  1.326100e+06   1.326100e+06
mean   2.311717e+01   3.710841e+00
std    7.909808e+01   1.120721e+00
min    0.000000e+00   1.000000e+00
25%    2.000000e+00   3.090000e+00
50%    5.000000e+00   3.900000e+00
75%    1.500000e+01   4.610000e+00
max    1.195400e+04   5.000000e+00

## Merging DataFrames

Let's start merging by inspecting all dataframes and renaming columns that have conflicting names in different dataframes to avoid running into trouble later on

In [49]:
r_df_clean.rename(columns={'stars': 'restaurant_stars', 'review_count': 'restaurant_review_count'}, inplace=True)
r_df_clean.head()

C:\Users\joona\Anaconda3\lib\site-packages\pandas\core\frame.py:3027: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  return super(DataFrame, self).rename(**kwargs)

,city,state,restaurant_stars,restaurant_review_count,category
business_id,,,,,
PfOCPjBrlQAnz__NXj9h_w,Cuyahoga Falls,OH,3.5,116,American (New)
o9eMRCWt5PkpLDE0gOPtcQ,Stuttgart,BW,4.0,5,Italian
XOSRcvtaKc_Q5H1SAzN20A,Houston,PA,4.5,3,Breakfast & Brunch
fNMVV_ZX7CJSDWQGdOM8Nw,Charlotte,NC,3.5,7,American (Traditional)
l09JfMeQ6ynYs5MCJtrcmQ,Toronto,ON,3.0,12,Italian

In [50]:
r_df_clean.info()

<class 'pandas.core.frame.DataFrame'>
Index: 38454 entries, PfOCPjBrlQAnz__NXj9h_w to UdEmYOnk2iJDY9lpEPAlJQ
Data columns (total 5 columns):
city                       38454 non-null object
state                      38454 non-null object
restaurant_stars           38454 non-null float64
restaurant_review_count    38454 non-null int64
category                   38454 non-null object
dtypes: float64(1), int64(1), object(3)
memory usage: 1.8+ MB

In [54]:
review_df.rename(columns={'stars': 'review_stars', 'date': 'review_date'}, inplace=True)
review_df.head()

,user_id,business_id,review_stars,review_date
review_id,,,,
vkVSCC7xljjrAI4UGfnKEQ,bv2nCi5Qv5vroFiqKGopiw,AEx2SYEUJmTxVVB18LlCwA,5,2016-05-28
n6QzIUObkYshz4dz2QRJTw,bv2nCi5Qv5vroFiqKGopiw,VR6GpWIda3SfvPC-lg9H3w,5,2016-05-28
MV3CcKScW05u5LVfF6ok0g,bv2nCi5Qv5vroFiqKGopiw,CKC0-MOWMqoeWf6s-szl8g,5,2016-05-28
IXvOzsEMYtiJI0CARmj77Q,bv2nCi5Qv5vroFiqKGopiw,ACFtxLv8pGrrxMm6EgjreA,4,2016-05-28
L_9BTb55X0GDtThi6GlZ6w,bv2nCi5Qv5vroFiqKGopiw,s2I_Ni76bjJNK9yG60iD-Q,4,2016-05-28

In [55]:
review_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5261668 entries, vkVSCC7xljjrAI4UGfnKEQ to ldsIs3sGXPJ7WM7VyAm4lQ
Data columns (total 4 columns):
user_id         object
business_id     object
review_stars    int64
review_date     object
dtypes: int64(1), object(3)
memory usage: 200.7+ MB

In [57]:
user_df.rename(columns={'review_count': 'user_review_count', 'average_stars': 'user_average_stars'}, inplace=True)
user_df.head()

                        user_review_count  user_average_stars
user_id
JJ-aSuM4pCFPdkfoZ34q0Q                 10                3.70
uUzsFQn_6cXDh6rPNGbIFA                  1                2.00
mBneaEEH5EMyxaVyqS-72A                  6                4.67
W5mJGs-dcDWRGEhAzUYtoA                  3                4.67
4E8--zUZO1Rr1IBK4_83fg                 11                3.45

In [58]:
user_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1326100 entries, JJ-aSuM4pCFPdkfoZ34q0Q to q-1Tz4SvaTpGEMhI_xwm0Q
Data columns (total 2 columns):
user_review_count     1326100 non-null int64
user_average_stars    1326100 non-null float64
dtypes: float64(1), int64(1)
memory usage: 30.4+ MB

As there are no missing values we can start merging by joining review_df and user_df on user_id. Using inner join we keep only users that have reviewed something and reviews on restaurants on the second join.

In [59]:
user_review_df = pd.merge(review_df, user_df, how='inner', left_on="user_id" , right_index= True)
user_review_df.head()

,user_id,business_id,review_stars,review_date,user_review_count,user_average_stars
review_id,,,,,,
vkVSCC7xljjrAI4UGfnKEQ,bv2nCi5Qv5vroFiqKGopiw,AEx2SYEUJmTxVVB18LlCwA,5,2016-05-28,6,4.67
n6QzIUObkYshz4dz2QRJTw,bv2nCi5Qv5vroFiqKGopiw,VR6GpWIda3SfvPC-lg9H3w,5,2016-05-28,6,4.67
MV3CcKScW05u5LVfF6ok0g,bv2nCi5Qv5vroFiqKGopiw,CKC0-MOWMqoeWf6s-szl8g,5,2016-05-28,6,4.67
IXvOzsEMYtiJI0CARmj77Q,bv2nCi5Qv5vroFiqKGopiw,ACFtxLv8pGrrxMm6EgjreA,4,2016-05-28,6,4.67
L_9BTb55X0GDtThi6GlZ6w,bv2nCi5Qv5vroFiqKGopiw,s2I_Ni76bjJNK9yG60iD-Q,4,2016-05-28,6,4.67

In [61]:
user_review_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5261662 entries, vkVSCC7xljjrAI4UGfnKEQ to ldsIs3sGXPJ7WM7VyAm4lQ
Data columns (total 6 columns):
user_id               object
business_id           object
review_stars          int64
review_date           object
user_review_count     int64
user_average_stars    float64
dtypes: float64(1), int64(2), object(3)
memory usage: 281.0+ MB

In [62]:
user_review_df.describe()

       review_stars  user_review_count  user_average_stars
count  5.261662e+06       5.261662e+06        5.261662e+06
mean   3.727738e+00       1.216500e+02        3.737311e+00
std    1.433593e+00       3.413802e+02        7.826569e-01
min    1.000000e+00       0.000000e+00        1.000000e+00
25%    3.000000e+00       7.000000e+00        3.400000e+00
50%    4.000000e+00       2.400000e+01        3.800000e+00
75%    5.000000e+00       9.700000e+01        4.200000e+00
max    5.000000e+00       1.195400e+04        5.000000e+00

In [63]:
user_review_df.isna().sum()

user_id               0
business_id           0
review_stars          0
review_date           0
user_review_count     0
user_average_stars    0
dtype: int64

Now we can join user_reviews_df with r_df_clean (containing restaurant information) on business_id to form the final data frame

In [64]:
final_df = pd.merge(user_review_df, r_df_clean, how='inner', left_on="business_id" , right_index= True)
final_df.head()

,user_id,business_id,review_stars,review_date,user_review_count,user_average_stars,city,state,restaurant_stars,restaurant_review_count,category
review_id,,,,,,,,,,,
vkVSCC7xljjrAI4UGfnKEQ,bv2nCi5Qv5vroFiqKGopiw,AEx2SYEUJmTxVVB18LlCwA,5,2016-05-28,6,4.67,Montral,QC,4.0,84,Diners
vm1b1keOzwHjtGZEPPuYXA,xYciRtVZ1PW4IxSX4oJ1aw,AEx2SYEUJmTxVVB18LlCwA,5,2016-02-22,177,3.41,Montral,QC,4.0,84,Diners
jUzausdZ_ujqe_n8BlBj-g,DVOOF0Z627DyrZ4XKQbTgA,AEx2SYEUJmTxVVB18LlCwA,5,2017-08-08,40,3.98,Montral,QC,4.0,84,Diners
SXwA9KZ-Nc_hMARk_3cJ7g,5Ymfsf9fAYz-Ds_p0xawVQ,AEx2SYEUJmTxVVB18LlCwA,5,2013-03-29,79,4.52,Montral,QC,4.0,84,Diners
oCRDwF3tszAkeszSfxwthg,5JoKz3mU42Cp906KRXDwJw,AEx2SYEUJmTxVVB18LlCwA,4,2009-01-17,3,4.00,Montral,QC,4.0,84,Diners

In [65]:
final_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2144848 entries, vkVSCC7xljjrAI4UGfnKEQ to 99hWXPtbpzXXbsL43RYuKA
Data columns (total 11 columns):
user_id                    object
business_id                object
review_stars               int64
review_date                object
user_review_count          int64
user_average_stars         float64
city                       object
state                      object
restaurant_stars           float64
restaurant_review_count    int64
category                   object
dtypes: float64(2), int64(3), object(6)
memory usage: 196.4+ MB

In [66]:
final_df.isna().sum()

user_id                    0
business_id                0
review_stars               0
review_date                0
user_review_count          0
user_average_stars         0
city                       0
state                      0
restaurant_stars           0
restaurant_review_count    0
category                   0
dtype: int64

In [67]:
final_df[final_df.duplicated()].count()

user_id                    0
business_id                0
review_stars               0
review_date                0
user_review_count          0
user_average_stars         0
city                       0
state                      0
restaurant_stars           0
restaurant_review_count    0
category                   0
dtype: int64

In [68]:
final_df.shape

(2144848, 11)

## Data output

In [71]:
final_df.to_csv('..\Yelp Dataset\merged_data.csv')